[
  {
    "id": "1729894155721",
    "userId": "722111043945627669",
    "username": "spongebobsquarepantsinc.",
    "message": "The Beginning",
    "timestamp": "2024-10-25T22:09:15.721Z"
  },
  {
    "id": "1729900015059",
    "userId": "862064693841100802",
    "username": "memyselfandfriends",
    "message": "Family tree by generations: \nLeo is Ben’s dad. Stryker is allegedly Sofia’s uncle, and is partnered to Justin, Kane, Aiden, and Alex, who's in the same generation as Sofia. Aiden is also Brook’s dad, skipping a generation. Justin is partnered with Ajith, who's in Sofia's custody, and possibly Aiden. Owen is Kane’s brother.\nBen, Alex, and Reza are all married to each other. Mihika is the mom of most of the kids and Reza stole them (according to Mihika). Reza is the dad and Mihika stole them (according to Reza). The kids got passed back and forth for a while before the infamous custody battle, at which point they started sharing custody. I’m Mihika’s sister, otherwise known as the crazy aunt. Sofia is married to Faith. Alice is Reza’s lawyer, but to preserve legal integrity can’t be related to anyone involved in the custody claim. \nKids of the Mihika/Reza situation are Braylon, Nathan, Sara, Jojo, Danielle, Brook, and Sophie. I think Braylon got adopted by Ben/Reza, Sara and Jojo stayed with Mihika, and Nathan stayed with Reza and then dropped off the face of the earth. At some point after the custody hearing, Danielle was adopted by Mihika. Later addition is Brook, who was adopted by Mihika, then Reza, then Sofia and by extension Faith, then me, then Muna. I adopted Truss and Aubrey. Sophie joined the server and was immediately claimed by Mihika and Noah, ended up with Mihika, then I stole her. Coco married and later divorced Brook, and then Stryker adopted Brook and Kane adopted Brook and Coco, skipping a generation. Sofia and Faith share custody of Brook (who was adopted by Sofia before Faith arrived) with me and Mihika. Sofia and Faith also share custody of Ajith, and Kermit is Sofia’s first kid, but Faith refuses to share custody. Lazy Susan (the cat) is Alice’s child. Maanya/Minihika is Brook’s kid.",
    "timestamp": "2024-10-25T23:46:55.059Z"
  }
]